"""这是一个学习变量的 Python 文件"""

'张三'
18
65.2

print("张三的体重是", 65.2)  # 张三的体重是 65.2
print("对于", 65.2, "这个体重，对于张三来说不是很满意")  # 对于 65.2 这个体重，对于张三来说不是很满意
print("张三决定开始减肥，希望体重比", 65.2, "还要小")  # 张三决定开始减肥，希望体重比 65.2 还要小

print("#######################################")

# 定义变量
name = '张三'
age = 18
# weight # 读取 weight 变量 -> 使用变量
# print("今天是 11 月 6 日，体重是", weight)
weight = 59 # 定义 weight 变量，然后值是 59
# print("今天是 11 月 7 日，体重是", weight)
weight = 58 # 让 weight 重新和 58 建立绑定关系

print("张三的体重是", weight)  # 张三的体重是 65.2
print("对于", weight, "这个体重，对于张三来说不是很满意")  # 对于 65.2 这个体重，对于张三来说不是很满意
print("张三决定开始减肥，希望体重比", weight, "还要小")  # 张三决定开始减肥，希望体重比 65.2 还要小
