# coding=utf-8

print('😦您现在身处密室，需要正确回答问题之后，才能逃出密室！')
# 定义问题
question = '你是什么人？'
# 定义答案
answer = '你的心上人'
# 定义用户输入的答案
guess = ''

# while True:
while guess != answer:
    print(f'密室问题：{question}')
    guess = input('请输入你的答案：')
    if guess == answer:
        print('✅️你的回答正确，逃脱成功！')
        break
    else:
        print('❌️你的回答错误，请再想想！')

# For Example：
# print('😦您现在身处密室，需要正确回答问题之后，才能逃出密室！')
# riddle = '你是什么人？'
# answer = '你的心上人'
# guess = ''
#
# while guess != answer:
#     print(f'问题：{riddle}')
#     guess = input('请输入答案：')
#     if guess == answer:
#         print('✅️答案正确，逃脱成功！')
#     else:
#         print('❌️回答错误，请再想想！')