# coding=utf-8

# 使用 for 循环实现
# 定义 30 天的计划
# day = 1
# for day in range(1, 31):
#     print(f'********📅第{day}天健身计划********')
#     # 定义 3 组的仰卧起坐！
#     for group in range(1, 4):
#         print(f'💪这是第{group}组的仰卧起坐！')
#     print(f'✅第{day}天健身计划完成，明天继续！')
#     print()
# # 最后打印的内容
# print(f'🎉为期{day}天的健身计划完成，我的腹肌在闪闪发光！')

# 使用 while 循环实现
# 定义 30 天的计划
day = 1
while day <= 30:
    print(f'********📅第{day}天健身计划********')
    # 定义仰卧起坐，每次循环都会重新赋值 group = 1
    group = 1
    while group <= 3:
        print(f'💪这是第{group}组的仰卧起坐！')
        group += 1
    print(f'✅第{day}天健身计划完成，明天继续！')
    day += 1
    print()
# 最后打印的内容
print(f'🎉为期{day - 1}天的健身计划完成，我的腹肌在闪闪发光！')
