# coding=utf-8

### 对列表进行切片
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[0:5:1]
# print(list2) # [10, 20, 30, 40, 50]

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[1:8:2]
# print(list2)  # [20, 40, 60, 80]

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[1:8:3]
# print(list2)  # [20, 50, 80]

# 相当于将原列表复制一份到新列表中（在切片中结束索引可以超过索引值）
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# # list2 = list1[0:10:1]  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[::]  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# print(list2)

# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[:999:]
# print(list2)  # [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# 获取列表中从第4个元素开始，之后的所有元素
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[3::]
# print(list2)  # [40, 50, 60, 70, 80, 90, 100]

# 获取列表中从第0个元素开始，到下标为 5 结束的元素
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[:5:]
# print(list2)  # [10, 20, 30, 40, 50]

# 获取列表中从第0个元素开始，每隔 3 个元素取一个元素
# list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
# list2 = list1[::4]
# print(list2)  # [10, 50, 90]

# 当起始索引大于结束索引时，步长必须为负数，否则结果是空列表。
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[7:2:-1]
print(list2)  # [80, 70, 60, 50, 40]

# 一个特殊情况：当同时省略起始索引和结束索引时，如果步长为负数，那Python会自动对调：起始位置和结束位置
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[::-1]
print(list2)  # [100, 90, 80, 70, 60, 50, 40, 30, 20, 10]

### 对元组进行切片
tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
tuple2 = tuple1[::-1]
print(tuple2)  # (100, 90, 80, 70, 60, 50, 40, 30, 20, 10)
tuple2 = tuple1[0:5:1]
print(tuple2)  # (10, 20, 30, 40, 50)

### 对字符串进行切片
msg1 = 'welcome to atguigu'
msg2 = msg1[2:9:2]
print(msg2)  # loet
