# coding=utf-8

# 定义有内容的字典
d1 = {'张三': 72, '李四': 85, '王五': 65, '赵六': 90}
print(type(d1), d1)

# 字典中的key不能重复，若出现重复，则后写的会覆盖之前写的
d1 = {'张三': 72, '李四': 60, '王五': 85, '张三': 99}
print(d1)

# 定义空字典
# null_d1 = {}
# null_d2 = dict()
# print(type(null_d1), null_d1)
# print(type(null_d2), null_d2)

# 字典中的key必须是不可变类型，但value可以是任意类型
# 通俗理解：只有不可变的东西，才能作为 Key
# d1 = {250: 72, '李四': 85, '王五': 65, '赵六': 90}
# d2= {('抽烟', '喝酒'): 72, '李四': 85, '王五': 65, '赵六': 90}
# print(d1)
# print(d2)

# 错误示例：将列表作为 Key 是不行的
# d2= {['抽烟', '喝酒']: 72, '李四': 85, '王五': 65, '赵六': 90}
# print(d2)
# TypeError: cannot use 'list' as a dict key (unhashable type: 'list')

# 字典是可以嵌套的（在 Go 语言中是结构体）
student_dict = {
    2025001: {
        'name': '张三',
        'age': 18,
        'sex': '男',
        'hobby': ['抽烟', '喝酒', '烫头']
    },
    2025002: {
        'name': '李四',
        'age': 19,
        'sex': '女',
        'hobby': ['打游戏', '看剧', '逛街']
    },
    2025003: {
        'name': '王五',
        'age': 20,
        'sex': '男',
        'hobby': ['爬山', '打篮球', '游泳']
    }
}
# student_dict = {
#     2025001: {
#         '姓名': '张三',
#         '年龄': 18,
#         '成绩': 72,
#         '爱好': ['抽烟', '喝酒', '烫头']
#     },
#     2025002: {
#         '姓名': '李四',
#         '年龄': 19,
#         '成绩': 60,
#         '爱好': ['唱歌', '跳舞', '打台球']
#     },
#     2025003: {
#         '姓名': '王五',
#         '年龄': 20,
#         '成绩': 85,
#         '爱好': ['学习', '看书', '打太极']
#     }
# }
print(student_dict)