# coding=utf-8

# 定义有内容的字典
# d1 = {'张三': 72, '李四': 60, '王五': 85}
# print(type(d1), d1)  # <class 'dict'> {'张三': 72, '李四': 60, '王五': 85}

# 字典中的key不能重复，若出现重复，则后写的会覆盖之前写的
# d1 = {'张三': 72, '李四': 60, '王五': 85, '张三': 99}
# print(type(d1), d1)  # <class 'dict'> {'张三': 99, '李四': 60, '王五': 85}

# 定义空字典
# d1 = {}
# d2 = dict()
# print(type(d1), d1)
# print(type(d2), d2)

# 字典中的key必须是不可变类型，但value可以是任意类型
# 通俗理解：只有不可变的东西，才能作为key
# d1 = {250: 72, '李四': 60, '王五': 85}
# d2 = {('抽烟', '喝酒'): 72, '李四': 60, '王五': 85}
# print(d1)
# print(d2)

# 错误示例：将列表作为key，是不行的
# d1 = {['抽烟', '喝酒']: 72, '李四': 60, '王五': 85}
# print(d1)  # TypeError: cannot use 'list' as a dict key (unhashable type: 'list')

# 字典是可以嵌套的
student_dict = {
    2025001: {
        '姓名': '张三',
        '年龄': 18,
        '性别': '男',
        '成绩': 72,
        '爱好': ['抽烟', '喝酒']
    },
    2025002: {
        '姓名': '李四',
        '年龄': 19,
        '性别': '男',
        '成绩': 60,
        '爱好': ['唱歌', '跳舞']
    },
    2025003: {
        '姓名': '王五',
        '年龄': 20,
        '性别': '男',
        '成绩': 85,
        '爱好': ['学习', '打太极']
    }
}
print(student_dict)

