# coding=utf-8

# 练习1:水果清单
fruits = {
    '苹果': 4.5,
    '香蕉': 3.2,
    '橙子': 5.8,
    '草莓': 12.0,
    '哈密瓜': 8.8
}

# 需求1: 打印所有的水果


# 需求2: 找到最贵水果


# ------------------------------------------------------------------------
print('*' * 50)
# 练习二:学生成绩表
students = [
    {
        'name': '张三',
        'scores': {'语文': 88, '数学': 92, '英语': 95}
    },
    {
        'name': '李四',
        'scores': {'语文': 75, '数学': 83, '英语': 80}
    },
    {
        'name': '王五',
        'scores': {'语文': 92, '数学': 95, '英语': 88}
    }
]

# 需求1: 计算每位学生的平均分

# 需求2: 找到总分最高的学生



# ------------------------------------------------------------------------
print('*' * 50)
# 练习三:评论内容

comment = '这家奶茶真好喝，环境也不错就是价格有点贵，好喝好喝好喝！强烈推荐！'

# 需求1: 统计“好喝”出现次数
result = comment.count('好喝')
print(f'"好喝"字数出现了 {result} 次')

# 需求2: 将字符串中的“贵”替换为“略高”
new_str = comment.replace('贵','略高')
print(new_str)

# 需求3: 是否包含“推荐”两个字
result = '推荐' in comment
print(f'包含"推荐"两个字: {result}')